/* Имеется отсортированный список из 128 имен, и вы ищете в нем значение методом бинарного поиска.
* Какое максимальное количество проверок для этого может потребоваться?
*
* log_{2}128 = 7 (2^7 === 128)
* */

/* Предположим, размер списка увеличился вдвое.
* Как изменится максимальное к-во проверок?
*
* log_{2}256 = 8 (2^8 === 256)
* */

/* Приведите время выполнения "О-большое" для каждого из следующих случаев */

/*
* Известна фамилия. Нужно найти номер в телефонной книге
*
* О(log n)
* */

/*
* Известен номер. Нужно найти фамилию.
*
* О(n)
* */

/*
* Нужно прочитать телефоны всех людей в телефонной книге
*
* О(n)
* */

/*
* Нужно прочитать телефоны всех людей, фамилии которых начинаются на А
*
* О(n)
* */

