/*
* Какие из следующих функций являются последовательными?
*
* f(x)===1 +
* f(x)===rand() -
* f(x)=== next empty index -
* f(x)=== x.length +
* */


/*
* Есть 4 хэш-функции. 1 – возвращает 1 для любого входящего значения. 2 – возвращает длину строки. 3 – первый символ строки.
* 4 – ставит в соответствие число каждой букве и возвращает остаток от деления всех значений на размер хэша.
* В каком из примеров будет хорошее распределение?
*
* Телефонная книга
* Ответ: 3, 4
*
* Связь размера батарейки с напряжением: А АА ААА АААА
* Ответ: 2, 4
*
* Связь названий книг с именами авторов
* Ответ: 2, 3, 4
* */